---
kind: method
id: M:Autodesk.Revit.DB.TessellatedBuildIssue.GetIssueDescription
source: html/5588d9b9-bde0-98ba-1ed2-0003300db90d.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssue.GetIssueDescription Method

Gets a string describing the issue. If the issue does
 not present a problem, then an empty string is returned.

## Syntax (C#)
```csharp
public string GetIssueDescription()
```

## Returns
Description of the issue.